start_text = '''🔥 «Привет! Рад видеть тебя здесь.
Я обучу тебя бесплатно и дам сигналы, но только если ты в моей команде. Это честный обмен: ты — мой реферал, я — твой наставник. Выбери, что тебе нужно👇»'''

exness_acc = 'У тебя уже есть аккаунт в Exness?'
no_access_to_exness = 'Вы не являетесь членом команды. Зарегистрируйтесь!'

training_no = '''✨ Отлично! Вот моя реферальная ссылка: https://one.exnesstrack.org/a/fgmuvyb1wc
После регистрации зайди в личный кабинет Exness и пришли сюда скриншот с подтверждением аккаунта.

Как только проверю — дам доступ к обучению 💪'''

training_yes = '''🔁 Если у тебя уже есть аккаунт, нужно изменить рефералку.

Вот инструкция:
1️⃣ Напиши в поддержку Exness: “Хочу изменить партнёрский код на https://one.exnesstrack.org/a/fgmuvyb1wc”
2️⃣ Дождись подтверждения.
3️⃣ Присылай сюда скрин, что рефералка изменена.

После проверки получишь доступ к материалам! 🚀'''

screenshot_invalid = 'Нужно отправить скриншот. Пришлите повторно или выйдите в главное меню.'

support_text = '''💬 Если у тебя остались вопросы — всегда можешь написать в нашу поддержку.
Мы отвечаем лично и максимально быстро ⚡
👇 Пиши сюда: @help_support_schooltrading'''

materials_text = '🎉 Поздравляю! Доступ к обучению открыт. Вот ссылка: https://t.me/+Ds__i1vUbAkzNGRi'
send_exness = 'Чтобы получить доступ к сигналам, нужно быть в моей команде Exness.'

start_chat = '''Отправь скриншот графика XAUUSD (15M или 1H), и я дам тебе свежий сигнал.'''
already_registered = '''Вы уже вступили в команду'''
